ror/blog/app/controllers/posts_controller.rb

INSERT INTO "posts" ("created_at", "title", "body", "updated_at") VALUES('2011-04-27 12:16:17', '', '', '2011-04-27 12:16:17')
---
  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save

SELECT * FROM "posts" WHERE ("posts"."id" = 1)
UPDATE "posts" SET "updated_at" = '2011-04-27 12:19:59', "title" = 'adsfgdfg', "body" = 'dfasdgfggdfg' WHERE "id" = 1
---
  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])